function isEven(num) {
  if (num % 2 === 0)  {
    return true;
  } else {
    return false;
  }
}
// โค้ดเดิมมีการใช้เงื่อนไขที่ไม่ถูกต้องในบรรทัดที่ 2 คือ num % 2 === 1 
// ซึ่งเป็นเงื่อนไขที่ใช้สำหรับตรวจสอบว่าเป็น "เลขคี่" 
// แต่ฟังก์ชันนี้มีจุดประสงค์เพื่อตรวจสอบว่าเป็น "เลขคู่" หรือไม่
// ดังนั้นจึงต้องแก้ไขเงื่อนไขให้เป็น num % 2 === 0 
// เพื่อให้ตรงกับสิ่งที่เราต้องการตรวจสอบ


// ตัวอย่างการทำงานที่ถูกต้อง
console.log(isEven(2)); // true
console.log(isEven(3)); // false
console.log(isEven(0)); // true
